Repository: LuanRoger/VolumeVault
Catalog: lib/l10n/app_*.arb
Languages: pt

# initialPageTitle
source: Keep your books safe and sound
pt: Mantenha seus livros salvos

# titleLoginPage
source: Login
pt: Entrar

# userTextFieldHint
source: User
pt: Usuário

# passwordTextFieldHint
source: Password
pt: Senha

# loginButtonLoginPage
source: Login
pt: Entrar

# doesNotHaveAccountLoginPage
source: Does't have an account?
pt: Não tem uma conta?

# signinButtonLoginPage
source: Create one
pt: Crie uma conta

# titleSigninPage
source: Signin
pt: Cadastrar

# signinButtonSigninPage
source: Signin
pt: Registrar-se

# fogotPasswordButtonSigninPage
source: Forgot password?
pt: Esqueceu a senha?

# resetPasswordDialogTitle
source: Reset password
pt: Redefinir senha

# alreadyHaveAccountSigninPage
source: Already have an account?
pt: Já tem uma conta?

# loginButtonSigninPage
source: Login
pt: Entre

# titleAppBarHomePage
source: Home
pt: Início

# helloUserAppBarHomePage
source: Hello, {user}
pt: Olá, {user}

# wellcomeBackAppBarHomePage
source: Wellcome back
pt: Bem-vindo(a) de volta.

# homeSectionLabelHomePage
source: Home
pt: Início

# configurationsSectionLabelHomePage
source: Settings
pt: Configurações

# searchBookTextFieldHint
source: Search for title, author, ISBN...
pt: Pesquisar por titulo, autor, ISBN...

# bookCountStatsHomePage
source: {count} books
pt: {count} livros

# signoutButtonHomePage
source: Signout
pt: Sair da conta

# homeSectionNavBar
source: Home
pt: Inicio

# addBookFabLabel
source: Add book
pt: Adicionar

# sortOptionApplySort
source: Apply
pt: Aplicar

# sortOptionAscending
source: Ascending
pt: Crescente

# sortOptionClearSort
source: Clear
pt: Limpar

# sortByTitleChip
source: Title
pt: Titulo

# sortByAuthorChip
source: Author
pt: Autor

# sortByReleaseDataChip
source: Release date
pt: Data de lançamento

# sortByPublisherChip
source: Publisher
pt: Editora

# sortByGenreChip
source: Genre
pt: Gênero

# sortByReadStartDayChip
source: Read start date
pt: Início da leitura

# sortByReadEndDayChip
source: Read end date
pt: Fim da leitura

# sortByRegisterDateChip
source: Register date
pt: Data de registro

# searchFilterBook
source: Books
pt: Livros

# allBooksFormatsTabOption
source: All
pt: Todos

# claimBadgesUserButtonMessage
source: Claim badges
pt: Resgatar distintivos

# synopsisBookViewerPage
source: Synopsis
pt: Sinopse

# informationsBookViewerPage
source: Informations
pt: Informações

# publisherBookViewerPage
source: Publisher
pt: Editora

# releaseYearBookViewerPage
source: Release year
pt: Ano de lançamento

# formatBookViewerPage
source: Format
pt: Formato

# readProgressBookViewerPage
source: Read progress
pt: Progresso da leitura

# createdAtBookViewerPage
source: Created at
pt: Criado em

# lastUpdateBookViewerPage
source: Last change
pt: Última modificação

# observationsBookViewerPage
source: Observations
pt: Observações

# genresBookViewerPage
source: Genres
pt: Gêneros

# deletePopupButtonBookViewerPage
source: Delete
pt: Deletar

# newBookAppBarTitle
source: New book
pt: Novo livro

# editBookAppBarTitle
source: Edit book
pt: Editar livro

# mandatoryFieldsWarning
source: Sections marked with "*" have mandatory fields.
pt: Seções que tem "*" possuem campos obrigatorios.

# bookInformationRegisterBookPage
source: Book information *
pt: Informações do livro *

# publisherInformationRegisterBookPage
source: Publisher information
pt: Informações da editora

# aditionalInformationRegisterBookPage
source: Aditional informations
pt: Informações adicionais

# synopsisAndObservationsRegisterBookPage
source: Synopsis and remarks
pt: Sinopse e observações

# readedRegisterBookPage
source: Readed
pt: Lido

# readStatusRegisterBookPage
source: Read progress
pt: Progresso da leitura

# notReadedStatusRegisterBookPage
source: Not readed
pt: Não lido

# readingStatusRegisterBookPage
source: Reading
pt: Lendo

# readedStatusRegisterBookPage
source: Has readed
pt: Lido

# readStartDayRegisterBookPage
source: Start of reading
pt: Início da leitura

# readEndDayRegisterBookPage
source: End of reading
pt: Fim da leitura

# addTagButtonRegisterBookPage
source: Add tag
pt: Adicionar

# confirmButtonRegisterBookPage
source: Confirm
pt: Confirmar

# hardcoverRegisterBookFormatOption
source: Hardcover
pt: Capa dura com proteção

# hardbackRegisterBookFormatOption
source: Hardback
pt: Capa dura

# paperbackRegisterBookFormatOption
source: Paperback
pt: Econômica

# ebookRegisterBookFormatOption
source: Ebook
pt: Digital

# pocketBookRegisterBookFormatOption
source: Pocket book
pt: Bolso

# audiobookRegisterBookFormatOption
source: Audiobook
pt: Audiolivro

# spiralBoundRegisterBookFormatOption
source: Spiral bound
pt: Com espiral/Caderno

# hqRegisterBookFormatOption
source: HQ
pt: Quadrinho

# collectorsEditionRegisterBookFormatOption
source: Collector's edition
pt: Edição de colecionador

# addQrDetectedInfo
source: Add
pt: Adicionar

# recuseQrDetectedInfo
source: Refuse
pt: Recusar

# configurationsAppBarTitle
source: Settings
pt: Configurações

# aperenceSectionTitleConfigurationsPage
source: Apearance
pt: Aparência

# themeOptionConfigurationsPage
source: Theme
pt: Tema

# ghaphicsSectionTitleConfigurationsPage
source: Graphics
pt: Gráficos

# lightEffectOptionConfigurationsPage
source: Light effect
pt: Efeito de luz

# otherSectionTitleConfigurationsPage
source: Other
pt: Outros

# restoreDefaultConfigurationsPage
source: Restore default configurations
pt: Restaurar configurações padrão

# problemDialogTitle
source: A problem has occurred
pt: Um problema ocorreu

# authErrorDialogMessage
source: Was not possible to validate the authentication token. Do login again.
pt: Não foi possível validar o token de autenticação. Faça login novamente.

# serverConnectionErrorDialogMessage
source: Was not possible to connect with server. Check the internet connection.
pt: Não foi possível conectar ao servidor. Verifique sua conexão com a internet.

# signoutDialogTitle
source: Exit
pt: Sair da conta?

# signoutDialogMessage
source: Are you want to logout?
pt: Deseja realmente sair da conta?

# cancelDialogButton
source: Cancel
pt: Cancelar

# confirmDialogButton
source: Confirm
pt: Confirmar

# exitDialogButton
source: Exit
pt: Sair

# bookCoverUrlInputDialogTitle
source: Cover image
pt: Imagem da capa

# tagInputDialogTitle
source: Add tag
pt: Adicionar tag

# editBookDialogTitle
source: Edit book
pt: Editar livro

# editBookDialogMessage
source: Do you want to save the changes?
pt: Deseja salvar as alterações?

# deleteBookDialogTitle
source: Delete book
pt: Deletar livro

# deleteBookDialogMessage
source: Are you sure you want to delete this book?
pt: Tem certeza que deseja deletar este livro?

# deleteDialogButton
source: Delete
pt: Deletar

# restoreDefaultConfigurationsDialogTitle
source: Restore default configurations
pt: Restaurar configurações padrão?

# restoreDefaultConfigurationsDialogMessage
source: All preferences will be restored as it was. Are you sure?
pt: Todas as configurações serão restauradas para o padrão. Deseja continuar?

# themeSelectionDialogTitle
source: Theme
pt: Tema

# themeSelectionDialogMessage
source: Select a theme:
pt: Selecione o tema desejado:

# lightThemeSelectionDialogOption
source: Light
pt: Claro

# darkThemeSelectionDialogOption
source: Dark
pt: Escuro

# systemThemeSelectionDialogOption
source: System
pt: Sistema

# verifyEmailDialogTitle
source: Verify email
pt: Verifique seu email

# verifyEmailDialogMessage
source: Your account does not have a verified email, so it has limitations. Do you want to check your email?
pt: A sua conta não possui um email verificado, portanto, ela possui limitações. Deseja verificar seu email?

# sendVerificationEmailDialogButton
source: Send verification email
pt: Envir email de verificação

# saveBottomSheetButton
source: Save
pt: Salvar

# selectBottomSheetButton
source: Select
pt: Selecionar

# bookTitleTextFieldHint
source: Title *
pt: Titulo *

# authorTextFieldHint
source: Author *
pt: Autor *

# publisherTextFieldHint
source: Publisher
pt: Editora

# releaseYearTextFieldHint
source: Release year
pt: Ano de lançamento

# editionTextFieldHint
source: Edition
pt: Edição

# formatTextFieldHint
source: Format
pt: Formato

# pageNumbersTextFieldHint
source: Page numbers
pt: N° de páginas

# genresTextFieldHint
source: Genres
pt: Gêneros

# buyLinkTextFieldHint
source: Buy link
pt: Link de compra

# observationsTextFieldHint
source: Remarks
pt: Observações

# synopsisTextFieldHint
source: Synopsis
pt: Sinopse

# noBookSelectedPlaceholderText
source: Select a book to view.
pt: Selecione um livro para visualizar.

# noRegisteredBooksPlaceholderText
source: No book registered.
pt: Nenhum livro cadastrado.

# notReadedReadProgressWidget
source: Not read
pt: Não lido

# readStartReadProgressWidget
source: Start
pt: Início

# readEndProgressWidget
source: End
pt: Término

# imageSourceGallery
source: Gallery
pt: Galeria

# wasNotPossibleToUpdateTheBookSnackbarMessage
source: Was not possible to update the book informations.
pt: Não foi possível atualizar o livro.

# registerBookErrorSnackbarMessage
source: An error occurs.
pt: Não foi possível cadastrar o livro.

# incorrectCredentialErrorSnackbarMessage
source: Incorrect credentials.
pt: Suas credenciais estão incorretas.

# userDoesNotExistErrorSnackbarMessage
source: This user does not exists. Create an account.
pt: Este usuário não existe. Crie uma conta.

# aErrorOccursErrorSnackbarMessage
source: A error occurs.
pt: Occoreu um error.

# recoveryPasswordEmailSentSnackbarMessage
source: A recovery email was sent to {email}
pt: Um email de recuperação da sua senha foi enviado para o email {email}

# emailAlreadyInUseErrorSnackbarMessage
source: This email is allready being used.
pt: Este email já está em uso.

# invalidEmailErrorSnackbarMessage
source: This email is invalid.
pt: Este email é inválido.

# verificationEmailSentSnackbarMessage
source: The verification email was sent.
pt: O email de verificação foi enviado.

# errorBadgeClaimSnackbarMessage
source: An error occurs while claiming the badge.
pt: Não foi possível regatar os distintivos.

# badgeCreator
source: Creator of VolumeVault
pt: Criador do VolumeVault

# badgeSponsor
source: Sponsor
pt: Apoiador

# badgeContributor
source: Contributor
pt: Contribuidor

# badgeTester
source: Tester
pt: Testador

# badgeBugHunter
source: Bug Hunter
pt: Caçador de bugs

# badgeEarlyAccessUser
source: Early Access User
pt: Usuário do Acesso Antecipado

# badgeVerifiedAccount
source: Verified Account
pt: Conta verificada

# badgeUnverifiedAccount
source: Unverified Account
pt: Conta não verificada

# fqaTitleAboutPage
source: FQAs
pt: Perguntas frequentes

# fqaQuestion1AboutPage
source: What is Volume Vault?
pt: O que é o Volume Vault?

# fqaQuestion1AnswerAboutPage
source: Volume Vault is an app that lets you store your favorite book information in one place, so you can easily access them.
pt: O Volume Vault é um aplicativo que permite que você armazene as informações dos seus livros favoritos em um só lugar, para que você possa acessá-los facilmente.

# fqaQuestion2AboutPage
source: How can I add a book?
pt: Como posso adicionar um livro?

# fqaQuestion2AnswerAboutPage
source: To add a book, just click the add button on the home screen, fill the fields with the necessary informations and confirm.
pt: Para adicionar um livro, basta clicar no botão de adicionar na tela inicial, adicionar as informações do livro e confirmar.

# fqaQuestion3AboutPage
source: Is it possible to edit a book?
pt: É possível editar um livro?

# fqaQuestion3AnswerAboutPage
source: Yes, just click on the book you want to edit on the Home screen and click on the edit icon on the book details screen in the upper right corner.
pt: Sim, basta clicar no livro que quer editar e clicar no ícone de editar na tela de detalhes do livro no canto superior direito.

# fqaQuestion4AboutPage
source: Is it possible to delete a book?
pt: É possível excluir um livro?

# fqaQuestion4AnswerAboutPage
source: Yes, just click on the book you want to delete on the Home screen and click on the delete icon on the book details screen in the top right corner.
pt: Sim, basta clicar no livro que quer excluir e clicar no ícone de excluir na tela de detalhes do livro no canto superior direito.

# fqaQuestion5AboutPage
source: Is it possible to share a book?
pt: É possível compartilhar um livro?

# fqaQuestion5AnswerAboutPage
source: Yes, just click on the book you want to share and click the share icon on the book details screen in the top right corner. To receive a book, on the home screen, just click on the button with the QR Code icon and scan the QR Code of the book you want to receive.
pt: Sim, basta clicar no livro que quer compartilhar e clicar no ícone de compartilhar na tela de detalhes do livro no canto superior direito. Para receber um livro basta, na tela inicial, clicar no botão com o ícone de QR Code e escanear o QR Code do livro que você quer receber.

# fqaQuestion6AboutPage
source: Can I query/search by book title, author, genre, etc?
pt: Posso fazer consultas/pesquisas por título do livro, autor, gênero, etc?

# fqaQuestion6AnswerAboutPage
source: Yes, just click the search button on the home screen and type what you want to search for. This is a single search field for all book information.
pt: Sim, basta clicar no botão de pesquisa na tela inicial e digitar o que deseja pesquisar. Este é um único campo de pesquisa para todas as informações dos livros.

# fqaQuestion7AboutPage
source: What is the purpose of books tags?
pt: Qual o propósito das tags?

# fqaQuestion7AnswerAboutPage
source: Tags are used to facilitate the search of books through keywords.
pt: As tags são usadas para facilitar na busca dos livros por meio de palavras-chave.

# fqaQuestion8AboutPage
source: Can I set a photo from my gallery as a book cover?
pt: Posso colocar uma foto da minha galeria como capa de um livro?

# fqaQuestion8AnswerAboutPage
source: No, currently Volume Vault does not support uploading photos from gallery or any other source. Currently, book covers can only be defined with an online URL.
pt: Não, atualmente o Volume Vault não suporta fazer upload de fotos da galeria ou qualquer outra fonte. Atualmente, capas dos livros podem ser definidas apenas com URL online.

# fqaQuestion9AboutPage
source: Can I change my profile username or email?
pt: Posso mudar o nome de usuário ou e-mail do meu perfil?

# fqaQuestion9AnswerAboutPage
source: It is currently not possible to make any changes to the information linked to the profile.
pt: Atualmente não é possível fazer qualquer tipo de alteração nas informações atreladas ao perfil.

# fqaQuestion10AboutPage
source: How many books can I add?
pt: Quantos livros posso adicionar?

# fqaQuestion10AnswerAboutPage
source: The limits for the number of registered books that can be registered are determined by your current plan. To learn more about limits, check out the available plans.
pt: Os limites para a quantidade de livros cadastrados que podem ser cadastrados são determinados pelo seu plano vigente. Para saber mais sobre os limites, consulte os planos disponíveis.

# fqaQuestion11AboutPage
source: If I cancel my current plan, will I lose the books that can exceed the limit of the free plan or any other plan that supports a smaller amount of books?
pt: Se eu cancelar meu plano atual, irei perder os livros que possam extrapolar o limite do plano gratuito ou qualquer outro que suporte uma quantidade menor de livros?

# fqaQuestion11AnswerAboutPage
source: No, the books that are above the limit of the current plan will be kept, however, it will not be possible to add new books until the number of registered books is within the limit of the current plan. In addition, there is a possibility that the books cannot be consulted if the current plan does not support the number of registered books.
pt: Não, os livros que estão acima da quantidade limite do plano atual, serão mantidos, porém, não será possível adicionar novos livros até que a quantidade de livros cadastrados esteja dentro do limite do plano atual. Além disso, há possibilidade dos livros não poderem ser mais consultados, caso o plano atual não suporte a quantidade de livros cadastrados.

# fqaQuestion12AboutPage
source: I was paying for a plan and I canceled it, can I pay again?
pt: Estava pagando um plano e cancelei, posso voltar a pagar?

# fqaQuestion12AnswerAboutPage
source: Yes, just choose the plan you want to subscribe to, just like the first time.
pt: Sim, basta escolher o plano que deseja assinar, assim como da primeira vez.

# fqaQuestion13AboutPage
source: Is it possible to export information from registered books to an external source such as a spreadsheet?
pt: É possível exportar as informações dos livros cadastrados para uma fonte externa como uma planilha?

# fqaQuestion13AnswerAboutPage
source: No, all data from registered books is managed by the application, including consultation.
pt: Não, todos os dados dos livros cadastrados são gerenciados pelo aplicativo, incluindo consulta.

# fqaQuestion14AboutPage
source: Is it possible to import information from registered books from an external source such as a spreadsheet?
pt: É possível importar as informações dos livros cadastrado de uma fonte externa como uma planilha?

# fqaQuestion14AnswerAboutPage
source: No, the origin of the registered information is the application.
pt: Não, a origem das informações cadastradas é o aplicativo.

# fqaQuestion15AboutPage
source: Is the information in the books secure?
pt: As informações dos livros estão seguras?

# fqaQuestion15AnswerAboutPage
source: Yes, all information generated by the application is retained by
pt: Sim, todas as informações geradas pelo aplicativo é retido pela plataforma

# fqaQuestion16AboutPage
source: As it is being developed by a single person, is there a chance that the application will be discontinued?
pt: Por estar sendo desenvolvido por uma pessoa só, há chances do aplicativo ser descontinuado?

# fqaQuestion16AnswerAboutPage
source: Yes, however, the app is designed to be a long-term project. In addition, if the application is discontinued, a notification will be issued by email to all registered users.
pt: Sim, porém, o aplicativo é desenvolvido com o intuito de ser um projeto de longo prazo. Além disso, caso o aplicativo venha a ser descontinuado, uma notificação será emitida por email para todos os usuários cadastrados.

# fqaQuestion17AboutPage
source: If the application has been discontinued will I lose the information of the books that I registered?
pt: Se o aplicativo for descontinuado irei perder as informações dos livros que cadastrei?

# fqaQuestion17AnswerAboutPage
source: No, a period of up to at least 1 semester (6 months) will be given for the user to take the necessary steps to save the information in the registered books. Within this period, a way to export information from registered books to an external source will be made available.
pt: Não, será dado um prazo de até, no mínimo, 1 semestre (6 meses) para que o usuário tome as devidas providências para salvar as informações dos livros cadastrados. Neste prazo será disponibilizado uma forma de exportar as informações dos livros cadastrados para uma fonte externa.

# fqaQuestion18AboutPage
source: Can I save an entire book (PDF, EPUB, etc) in the app?
pt: Posso salvar um livro inteiro (PDF, EPUB, etc) no aplicativo?

# fqaQuestion18AnswerAboutPage
source: The app does not allow you to upload book files, only information about the books. Additionally, Volume Vault does not provide any means of purchasing or acquiring books.
pt: O aplicativo não permite o upload de arquivos de livros, apenas informações sobre os livros. Além disso, o Volume Vault não disponibiliza nenhum meio de compra ou aquisição de livros.
